Guiimartinho/speeduino-stm32f407-refactor/speeduino/sensors.cpp
} // anonymous namespace

/**
 * @brief Initialize ADC hardware and configure auxiliary input channels.
 *
 * Configures platform-specific ADC hardware (AVR ISR/polling or STM32),
 * initializes auxiliary CAN input channels, validates ADC filter settings,
 * and resets sensor state.
 *
 * @note MISRA-C compliant refactored version (111 lines → 33 lines + 9 helpers)
 * @complexity C:6, N:2 (down from C:25+, N:5)
 */
void initialiseADC(void)
{
  configureADC_AVR_ISR();
  configureADC_AVR_Polling();
  configureADC_STM32();

  initialiseAuxInputChannels();
  validateADCFilters();

  flexStartTime = micros();
  vssIndex = 0;
}


// ==========================================  MAP ==========================================

static constexpr uint16_t VALID_MAP_MAX=1022U; //The largest ADC value that is valid for the MAP sensor
static constexpr uint16_t VALID_MAP_MIN=2U; //The smallest ADC value that is valid for the MAP sensor

TESTABLE_INLINE_STATIC bool instanteneousMAPReading(void)
{
  // All we need to do it signal that the new readings should be used as-is
  return true;
}

static inline bool cycleAverageMAPReadingAccumulate(map_cycle_average_t &cycle_average, const map_adc_readings_t &sensorReadings) {
  ++cycle_average.sampleCount;
  cycle_average.mapAdcRunningTotal += sensorReadings.mapADC; 
  cycle_average.emapAdcRunningTotal += sensorReadings.emapADC;

  // We are *not* ready to derive new maps readings yet
  return false;
}

static inline void reset(const statuses &current, map_cycle_average_t &cycle_average, const map_adc_readings_t &sensorReadings) {
  cycle_average.sampleCount = 0U;
  cycle_average.mapAdcRunningTotal = 0U;
  cycle_average.emapAdcRunningTotal = 0U;
  cycle_average.cycleStartIndex = (uint8_t)current.startRevolutions;
  (void)cycleAverageMAPReadingAccumulate(cycle_average, sensorReadings);
}

static inline bool cycleAverageEndCycle(const statuses &current, map_cycle_average_t &cycle_average, map_adc_readings_t &sensorReadings) {
  if( (cycle_average.mapAdcRunningTotal != 0UL) && (cycle_average.sampleCount != 0U) )
  {
    // Record this since we're about to overwrite it....
    map_adc_readings_t rawReadings = sensorReadings;

    sensorReadings.mapADC = udiv_32_16(cycle_average.mapAdcRunningTotal, cycle_average.sampleCount);

    //If EMAP is enabled, the process is identical to the above
    if(sensorReadings.emapADC!=UINT16_MAX)
    {
      sensorReadings.emapADC = udiv_32_16(cycle_average.emapAdcRunningTotal, cycle_average.sampleCount); //Note that the MAP count can be reused here as it will always be the same count.
    }
    reset(current, cycle_average, rawReadings);
    // We can now derive new map values
    return true;
  }
  
  reset(current, cycle_average, sensorReadings);
  return instanteneousMAPReading(); 
}

static inline bool isCycleCurrent(const statuses &current, uint32_t cycleStartIndex) {
  ATOMIC() {
    return (cycleStartIndex == (uint8_t)current.startRevolutions) || ((cycleStartIndex+1U) == (uint8_t)current.startRevolutions);
  }
  return false; // Just here to avoid compiler warning.
}

static inline bool isCycleCurrent(const statuses &current, const map_cycle_average_t &cycle_avg) {
  return isCycleCurrent(current, cycle_avg.cycleStartIndex);
}

TESTABLE_INLINE_STATIC bool canUseCycleAverage(const statuses &current, const config2 &page2) {
  ATOMIC() {
    return (current.RPMdiv100 > page2.mapSwitchPoint) && HasAnySyncUnsafe(current) && (current.startRevolutions > 1U);
  }
  return false; // Just here to avoid compiler warning.
}

TESTABLE_INLINE_STATIC bool cycleAverageMAPReading(const statuses &current, const config2 &page2, map_cycle_average_t &cycle_average, map_adc_readings_t &sensorReadings) {
  if ( canUseCycleAverage(current, page2) )
  {
    //2 revolutions are looked at for 4 stroke. 2 stroke not currently catered for.
    if( isCycleCurrent(current, cycle_average) ) {
      return cycleAverageMAPReadingAccumulate(cycle_average, sensorReadings);
    }
    // Reaching here means that the last cycle has completed and the MAP value should be calculated
    return cycleAverageEndCycle(current, cycle_average, sensorReadings);
  }
  
  //If the engine isn't running and RPM below switch point, fall back to instantaneous reads
  reset(current, cycle_average, sensorReadings);
  return instanteneousMAPReading();
}

static inline bool cycleMinimumAccumulate(map_cycle_min_t &cycle_min, const map_adc_readings_t &sensorReadings) {
  //Check whether the current reading is lower than the running minimum
  cycle_min.mapMinimum = min(sensorReadings.mapADC, cycle_min.mapMinimum); 

  // We are *not* ready to derive new maps readings yet
  return false;
}

static inline void reset(const statuses &current, map_cycle_min_t &cycle_min, const map_adc_readings_t &sensorReadings) {
  cycle_min.cycleStartIndex = (uint8_t)current.startRevolutions; //Reset the current rev count
  cycle_min.mapMinimum = sensorReadings.mapADC; //Reset the latest value so the next reading will always be lower
}

static inline bool cycleMinimumEndCycle(const statuses &current, map_cycle_min_t &cycle_min, map_adc_readings_t &sensorReadings) {
  // Record this since we're about to overwrite it....
  map_adc_readings_t rawReadings = sensorReadings;

  sensorReadings.mapADC = cycle_min.mapMinimum;

  reset(current, cycle_min, rawReadings);

  // We can now derive new map values
  return true;
}

static inline bool isCycleCurrent(const statuses &current, const map_cycle_min_t &cycle_min) {
  return isCycleCurrent(current, cycle_min.cycleStartIndex);
}

TESTABLE_INLINE_STATIC bool cycleMinimumMAPReading(const statuses &current, const config2 &page2, map_cycle_min_t &cycle_min, map_adc_readings_t &sensorReadings) {
  if (current.RPMdiv100 > page2.mapSwitchPoint) {
    //2 revolutions are looked at for 4 stroke. 2 stroke not currently catered for.
    if ( isCycleCurrent(current, cycle_min) ) {
      return cycleMinimumAccumulate(cycle_min, sensorReadings);
    }
      //Reaching here means that the last cycle has completed and the MAP value should be calculated
    return cycleMinimumEndCycle(current, cycle_min, sensorReadings);
  }

  //If the engine isn't running and RPM below switch point, fall back to instantaneous reads
  reset(current, cycle_min, sensorReadings);
  return instanteneousMAPReading();
}

static inline bool eventAverageAccumulate(map_event_average_t &eventAverage, const map_adc_readings_t &sensorReadings) {
  eventAverage.mapAdcRunningTotal += sensorReadings.mapADC; //Add the current reading onto the total
  ++eventAverage.sampleCount;

  // We are *not* ready to derive new maps readings yet
  return false;
}

static inline bool isIgnitionEventValid(const map_event_average_t &eventAverage) {
  ATOMIC() {
    return (eventAverage.eventStartIndex < (uint8_t)ignitionCount);
  }
  return false; // Just here to avoid compiler warning.
}

