Guiimartinho/speeduino-stm32f407-refactor/speeduino/sensors.cpp
static inline void reset(map_event_average_t &eventAverage, const map_adc_readings_t &sensorReadings) {
  // Reset for next cycle.
  eventAverage.mapAdcRunningTotal = 0U;
  eventAverage.sampleCount = 0U;
  eventAverage.eventStartIndex = (uint8_t)ignitionCount;
  (void)eventAverageAccumulate(eventAverage, sensorReadings);
}

static inline bool eventAverageEndEvent(map_event_average_t &eventAverage, map_adc_readings_t &sensorReadings) {
  //Sanity check
  if( (eventAverage.mapAdcRunningTotal != 0U) && (eventAverage.sampleCount != 0U) && isIgnitionEventValid(eventAverage) )
  {
    // Record this since we're about to overwrite it....
    map_adc_readings_t rawReadings = sensorReadings;
    sensorReadings.mapADC = udiv_32_16(eventAverage.mapAdcRunningTotal, eventAverage.sampleCount);
    reset(eventAverage, rawReadings);
    // We can now derive new map values
    return true;
  }
  
  reset(eventAverage, sensorReadings);
  return instanteneousMAPReading(); 
}

static inline bool isIgnitionEventCurrent(const map_event_average_t &eventAverage) {
  ATOMIC() {
    return (eventAverage.eventStartIndex == (uint8_t)ignitionCount);
  }
  return false; // Just here to avoid compiler warning.
}


TESTABLE_INLINE_STATIC bool canUseEventAverage(const statuses &current, const config2 &page2) {
  ATOMIC() {
    return (current.RPMdiv100 > page2.mapSwitchPoint) && HasAnySyncUnsafe(current) && (current.startRevolutions > 1U) && (!current.engineProtectStatus);
  }
  return false; // Just here to avoid compiler warning.
}

TESTABLE_INLINE_STATIC bool eventAverageMAPReading(const statuses &current, const config2 &page2, map_event_average_t &eventAverage, map_adc_readings_t &sensorReadings) {
  //Average of an ignition event
  if ( canUseEventAverage(current, page2) ) //If the engine isn't running, fall back to instantaneous reads
  {
    if( isIgnitionEventCurrent(eventAverage) ) { //Watch for a change in the ignition counter to determine whether we're still on the same event
      return eventAverageAccumulate(eventAverage, sensorReadings);
    }
    
    //Reaching here means that the next ignition event has occurred and the MAP value should be calculated
    return eventAverageEndEvent(eventAverage, sensorReadings);
  }

  reset(eventAverage, sensorReadings);
  return instanteneousMAPReading();
}

static inline bool isValidMapSensorReading(uint16_t reading) {
  return (reading < VALID_MAP_MAX) && (reading > VALID_MAP_MIN);  
}

TESTABLE_INLINE_STATIC uint16_t validateFilterMapSensorReading(uint16_t reading, uint8_t alpha, uint16_t prior) {
  //Error check
  if (isValidMapSensorReading(reading)) { 
    return LOW_PASS_FILTER(reading, alpha, prior);
  }
  return prior;
}

static inline uint16_t readFilteredMapADC(uint8_t pin, uint8_t alpha, uint16_t prior) {
  return validateFilterMapSensorReading(readMAPSensor(pin), alpha, prior);
}

static inline map_adc_readings_t readMapSensors(const map_adc_readings_t &previousReadings, const config4 &page4, bool useEMAP) {
  return {
    readFilteredMapADC(pinMAP, page4.ADCFILTER_MAP, previousReadings.mapADC),
    (uint16_t)(useEMAP ? readFilteredMapADC(pinEMAP, page4.ADCFILTER_MAP, previousReadings.emapADC) : UINT16_MAX)
  };
}

static inline void storeLastMAPReadings(map_last_read_t &lastRead, uint16_t oldMAPValue) 
{
  //Update the calculation times and last value. These are used by the MAP based Accel enrich
  uint32_t currTime = micros();
  lastRead.lastMAPValue = oldMAPValue;
  // lastRead.lastReadingTime = lastRead.currentReadingTime;
  lastRead.timeDeltaReadings = currTime - lastRead.currentReadingTime;
  lastRead.currentReadingTime = currTime;
}

static inline uint16_t mapADCToMAP(uint16_t mapADC, int8_t mapMin, uint16_t mapMax) 
{
  int16_t mapped = fastMap10Bit(mapADC, mapMin, mapMax); //Get the current MAP value
  return max((int16_t)0, mapped);  //Sanity check
}

static inline void setMAPValuesFromReadings(const map_adc_readings_t &readings, const config2 &page2, bool useEMAP, statuses &current) 
{
  current.MAP = mapADCToMAP(readings.mapADC, page2.mapMin, page2.mapMax); //Get the current MAP value
  //Repeat for EMAP if it's enabled
  if(useEMAP) { current.EMAP = mapADCToMAP(readings.emapADC, page2.EMAPMin, page2.EMAPMax); }
}

#if defined(UNIT_TEST)
map_last_read_t& getMapLast(void){
  return mapAlgorithmState.lastReading;
}
#endif

/**
 * @brief Read Manifold Absolute Pressure (MAP) sensor with advanced sampling algorithms.
 *
 * Core sensor reading function that implements multiple MAP sampling strategies
 * optimized for different engine conditions. Converts raw ADC to calibrated kPa.
 *
 * **Sampling Algorithms (configPage2.mapSample):**
 * 1. **Instantaneous** - Direct reading, lowest latency
 *    - Best for: Steady-state tuning, low-pulsation intakes
 * 2. **Cycle Average** - Average over 720° (2 revolutions)
 *    - Best for: Individual throttle bodies (ITBs), aggressive cams
 *    - Smooths intake pulsations
 * 3. **Cycle Minimum** - Minimum value over 720°
 *    - Best for: Vacuum spike detection, peak analysis
 * 4. **Event Average** - Average over single ignition event
 *    - Best for: Synchronized per-cylinder sampling
 *    - Requires stable sync
 *
 * **Dual-Sensor Support:**
 * - **MAP:** Intake manifold pressure (always enabled)
 * - **EMAP:** Exhaust manifold pressure (turbocharged engines only)
 * - Both sensors use same sampling algorithm
 *
 * **Low-Pass Filtering:**
 * - Filter constant: `configPage4.ADCFILTER_MAP`
 * - Applied before sampling algorithm
 * - ADC validation: Rejects readings <2 or >1022 (sensor fault protection)
 *
 * **Accel Enrichment Support:**
 * - Stores previous MAP value and timestamp
 * - Time delta used for MAP-based acceleration detection
 * - Accessed via `getMAPDelta()` and `getMAPDeltaTime()`
 *
 * @note Updates `currentStatus.MAP` (kPa), `currentStatus.EMAP` (kPa if enabled)
 * @note MAP value only updated when sampling algorithm signals validity
 * @note Algorithm state preserved in `mapAlgorithmState` (static storage)
 * @note Thread-safe: Uses atomic operations for ISR-shared variables
 * @complexity C:5, N:2
 * @see initialiseMAPBaro() for startup initialization
 * @see resetMAPcycleAndEvent() to clear algorithm state
 */
void readMAP(void)
{
  // Read sensor(s). Saves filtered ADC readings. Does not set calibrated MAP and EMAP values.
  mapAlgorithmState.sensorReadings = readMapSensors(mapAlgorithmState.sensorReadings, configPage4, configPage6.useEMAP);

  bool readingIsValid;
  switch(configPage2.mapSample)
  {
    case MAPSamplingCycleAverage:
      readingIsValid = cycleAverageMAPReading(currentStatus, configPage2, mapAlgorithmState.cycle_average, mapAlgorithmState.sensorReadings);
      break;

    case MAPSamplingCycleMinimum:
      readingIsValid = cycleMinimumMAPReading(currentStatus, configPage2, mapAlgorithmState.cycle_min, mapAlgorithmState.sensorReadings);
      break;

    case MAPSamplingIgnitionEventAverage:
      readingIsValid = eventAverageMAPReading(currentStatus, configPage2, mapAlgorithmState.event_average, mapAlgorithmState.sensorReadings);
      break; 

