Guiimartinho/speeduino-stm32f407-refactor/speeduino/sensors.cpp
    case MAPSamplingInstantaneous:
    default:
      readingIsValid = instanteneousMAPReading();
      break;
  }

  // Process sensor readings according to user chosen sampling algorithm
  if(readingIsValid) 
  {
    // Roll over the last reading
    storeLastMAPReadings(mapAlgorithmState.lastReading, currentStatus.MAP);

    // Convert from filtered sensor readings to kPa
    setMAPValuesFromReadings(mapAlgorithmState.sensorReadings, configPage2, configPage6.useEMAP, currentStatus);
  }
}

/**
 * @brief Get MAP change (delta) between last two valid readings.
 *
 * Returns the difference in manifold pressure between the current reading
 * and the previous valid reading. Used for MAP-based acceleration enrichment
 * detection (tip-in/tip-out events).
 *
 * **Use Cases:**
 * - **Acceleration Enrichment:** Positive delta = tip-in (add fuel)
 * - **Deceleration Enleanment:** Negative delta = tip-out (cut fuel)
 * - **Transient Detection:** Large delta = throttle change event
 * - **AE Tuning:** Delta vs time determines enrichment amount
 *
 * **Delta Characteristics:**
 * - **Positive:** MAP increased (throttle opened, boost spike)
 * - **Negative:** MAP decreased (throttle closed, vacuum increase)
 * - **Zero:** Steady-state conditions
 *
 * @return MAP change in kPa (range: -255 to +255)
 * @note Signed value: positive = pressure increase, negative = decrease
 * @note Updated only when sampling algorithm signals valid reading
 * @note Time between readings available via `getMAPDeltaTime()`
 * @see getMAPDeltaTime() for time delta calculation
 * @see readMAP() for MAP sampling and delta storage
 */
int16_t getMAPDelta(void) {
  return (int16_t)currentStatus.MAP - (int16_t)mapAlgorithmState.lastReading.lastMAPValue;
}

/**
 * @brief Get time gap (microseconds) between last two valid MAP readings.
 *
 * Returns the time elapsed between the current MAP reading and the previous
 * valid reading. Used in combination with `getMAPDelta()` to calculate
 * rate-of-change (kPa/s) for acceleration enrichment tuning.
 *
 * **Use Cases:**
 * - **AE Rate Calculation:** delta_kPa / delta_time = rate of change
 * - **Throttle Response Analysis:** Time to reach target MAP
 * - **Sampling Frequency Validation:** Verify MAP update rate
 * - **Transient Tuning:** Fast changes need different enrichment
 *
 * **Time Characteristics:**
 * - **Instantaneous Mode:** ~10-20 ms between readings (main loop speed)
 * - **Cycle Average Mode:** ~60-120 ms (720° at 1000-2000 RPM)
 * - **Event Average Mode:** Variable (depends on RPM and cylinders)
 *
 * @return Time between readings in microseconds (0 at startup)
 * @note Returns 0 if only one reading taken since startup
 * @note Time delta stored in `mapAlgorithmState.lastReading.timeDeltaReadings`
 * @note Updated only when sampling algorithm signals valid reading
 * @see getMAPDelta() for MAP pressure change calculation
 * @see readMAP() for MAP sampling and delta storage
 */
uint32_t getMAPDeltaTime(void) {
  return mapAlgorithmState.lastReading.timeDeltaReadings;
}

// ========================================== TPS ==========================================

/**
 * @brief Read Throttle Position Sensor (TPS) with calibration and filtering.
 *
 * Reads raw ADC value from TPS pin, applies low-pass filter, and converts
 * to 0-200% range (200 = 100% physical throttle opening, allowing for overshoot).
 * Supports both normal and reversed wiring configurations.
 *
 * **Calibration:**
 * - `configPage2.tpsMin`: ADC value at closed throttle (0%)
 * - `configPage2.tpsMax`: ADC value at wide-open throttle (100%)
 * - If `tpsMin > tpsMax`: wiring is reversed, values are inverted automatically
 *
 * **Closed Throttle Position Sensor (CTPS):**
 * - Optional digital switch that activates at idle
 * - Polarity configurable (ground-switched or 5V-activated)
 *
 * @param useFilter If true, applies low-pass filter (use false for startup flood clear)
 * @note Updates `currentStatus.TPS`, `currentStatus.tpsADC`, `currentStatus.CTPSActive`
 * @note Filter constant: `configPage4.ADCFILTER_TPS`
 */
void readTPS(bool useFilter)
{
  currentStatus.TPSlast = currentStatus.TPS;
  uint8_t tempTPS = (uint8_t)fastMap10Bit(readAnalogSensor(pinTPS), 0U, 255U); //Get the current raw TPS ADC value and map it into a uint8_t

  //The use of the filter can be overridden if required. This is used on startup to disable priming pulse if flood clear is wanted
  if(useFilter == true) { currentStatus.tpsADC = (uint8_t)LOW_PASS_FILTER((uint16_t)tempTPS, configPage4.ADCFILTER_TPS, (uint16_t)currentStatus.tpsADC); }
  else { currentStatus.tpsADC = tempTPS; }
  uint8_t tempADC = currentStatus.tpsADC; //The tempADC value is used in order to allow TunerStudio to recover and redo the TPS calibration if this somehow gets corrupted

  if(configPage2.tpsMax > configPage2.tpsMin)
  {
    //Check that the ADC values fall within the min and max ranges (Should always be the case, but noise can cause these to fluctuate outside the defined range).
    tempADC = clamp(tempADC, configPage2.tpsMin, configPage2.tpsMax);
    currentStatus.TPS = map(tempADC, configPage2.tpsMin, configPage2.tpsMax, 0, 200); //Take the raw TPS ADC value and convert it into a TPS% based on the calibrated values
  }
  else
  {
    //This case occurs when the TPS +5v and gnd are wired backwards, but the user wishes to retain this configuration.
    //In such a case, tpsMin will be greater then tpsMax and hence checks and mapping needs to be reversed

    tempADC = UINT8_MAX - tempADC; //Reverse the ADC values
    uint8_t tempTPSMax = UINT8_MAX - configPage2.tpsMax;
    uint8_t tempTPSMin = UINT8_MAX - configPage2.tpsMin;

    //All checks below are reversed from the standard case above
    tempADC = clamp(tempADC, tempTPSMin, tempTPSMax);
    currentStatus.TPS = map(tempADC, tempTPSMin, tempTPSMax, 0, 200);
  }

  //Check whether the closed throttle position sensor is active
  if(configPage2.CTPSEnabled == true)
  {
    if(configPage2.CTPSPolarity == 0U) { currentStatus.CTPSActive = !digitalRead(pinCTPS); } //Normal mode (ground switched)
    else { currentStatus.CTPSActive = digitalRead(pinCTPS); } //Inverted mode (5v activates closed throttle position sensor)
  }
  else { currentStatus.CTPSActive = 0; }
}

/**
 * @brief Read Coolant Temperature (CLT) sensor with NTC calibration.
 *
 * Reads raw ADC value from CLT pin, applies optional filtering, and converts
 * to temperature using 32-point NTC thermistor calibration table stored in EEPROM.
 *
 * **Calibration Table:**
 * - X-axis: Raw ADC values (0-1023)
 * - Y-axis: Temperature values (offset by +40 to allow negative temps)
 * - 32 calibration points for accurate non-linear NTC response
 *
 * **Temperature Range:**
 * - Storage: 0-255 (represents -40°C to +215°C)
 * - Output: Offset removed (actual temperature in °C)
 *
 * @param useFilter If true, applies low-pass filter (use false for immediate priming)
 * @note Updates `currentStatus.coolant`, `currentStatus.cltADC`
 * @note Filter constant: `configPage4.ADCFILTER_CLT`
 * @note Calibration table: `cltCalibrationTable` (32 points)
 */
void readCLT(bool useFilter)
{
  uint16_t tempReading = readAnalogSensor(pinCLT);
  //The use of the filter can be overridden if required. This is used on startup so there can be an immediately accurate coolant value for priming
  if(useFilter == true) { currentStatus.cltADC = LOW_PASS_FILTER(tempReading, configPage4.ADCFILTER_CLT, currentStatus.cltADC); }
  else { currentStatus.cltADC = tempReading; }
  
  currentStatus.coolant = temperatureRemoveOffset(table2D_getValue(&cltCalibrationTable, currentStatus.cltADC)); //Temperature calibration values are stored as positive bytes. We subtract 40 from them to allow for negative temperatures
}

/**
 * @brief Read Intake Air Temperature (IAT) sensor with NTC calibration.
 *
 * Reads raw ADC value from IAT pin, applies low-pass filter, and converts
 * to temperature using 32-point NTC thermistor calibration table stored in EEPROM.
 *
 * **Calibration Table:**
 * - Same format as CLT (32-point NTC curve)
 * - X-axis: Raw ADC values (0-1023)
 * - Y-axis: Temperature values (offset by +40°C)
 *
 * **Usage:**
 * - Density altitude calculations
 * - Charge temperature corrections
 * - Intercooler efficiency monitoring
 *
 * @note Updates `currentStatus.IAT`, `currentStatus.iatADC`
 * @note Filter constant: `configPage4.ADCFILTER_IAT`
 * @note Always filtered (no bypass parameter like CLT/TPS)
 */
void readIAT(void)
{
  currentStatus.iatADC = LOW_PASS_FILTER(readAnalogSensor(pinIAT), configPage4.ADCFILTER_IAT, currentStatus.iatADC);
  currentStatus.IAT = temperatureRemoveOffset(table2D_getValue(&iatCalibrationTable, currentStatus.iatADC));
}

