Guiimartinho/speeduino-stm32f407-refactor/speeduino/sensors.cpp
// ========================================== Baro ==========================================

/* 
* The highest sea-level pressure on Earth occurs in Siberia, where the Siberian High often attains a sea-level pressure above 105 kPa;
* with record highs close to 108.5 kPa.
* The lowest possible baro reading is based on an altitude of 3500m above sea level.
*/
static inline bool isValidBaro(uint8_t baro) 
{
  static constexpr uint16_t BARO_MIN = 65U;
  static constexpr uint16_t BARO_MAX = 108U;

  return (baro >= BARO_MIN) && (baro <= BARO_MAX);
}

static inline void setBaroFromSensorReading(uint16_t sensorReading) 
{
  currentStatus.baroADC = sensorReading;
  int16_t tempValue = fastMap10Bit(currentStatus.baroADC, configPage2.baroMin, configPage2.baroMax);
  currentStatus.baro = (uint8_t)max((int16_t)0, tempValue);
}

// Should only be called when the engine isn't running.
static inline void setBaroFromMAP(void) 
{
  uint16_t tempReading = mapADCToMAP(readMAPSensor(pinMAP), configPage2.mapMin, configPage2.mapMax);
  if (isValidBaro(tempReading)) //Safety check to ensure the baro reading is within the physical limits
  {
    currentStatus.baro = tempReading;
    if(!BIT_CHECK(statusSensors, BIT_SENSORS_BARO_SAVED))
    {
      storeLastBaro(currentStatus.baro); 
      BIT_SET(statusSensors, BIT_SENSORS_BARO_SAVED); //Flag baro as having been saved. This prevents multiple writes happening, which can cause issues on stm32 with internal flash
    }
  }
}

/**
 * @brief Read barometric pressure sensor (or derive from MAP when engine stopped).
 *
 * Operates in two modes:
 * 1. **External Baro Sensor** (`configPage6.useExtBaro != 0`):
 *    - Reads dedicated baro sensor pin with low-pass filter
 * 2. **MAP-Based Baro** (no external sensor):
 *    - When engine is stopped (RPM=0 for >1 second), uses MAP reading as baro
 *    - Saves valid reading to EEPROM for next startup
 *
 * **Valid Range:**
 * - Minimum: 65 kPa (altitude ~3500m above sea level)
 * - Maximum: 108 kPa (Siberian High record pressure)
 * - Invalid readings are rejected to prevent corruption
 *
 * @note Updates `currentStatus.baro`, `currentStatus.baroADC` (if external sensor)
 * @note Filter constant: `configPage4.ADCFILTER_BARO` (very weak filter)
 * @note EEPROM save protected by `BIT_SENSORS_BARO_SAVED` flag
 */
void readBaro(void)
{
  if ( configPage6.useExtBaro != 0U  ) 
  {
    // readings
    setBaroFromSensorReading(LOW_PASS_FILTER(readMAPSensor(pinBaro), configPage4.ADCFILTER_BARO, currentStatus.baroADC)); //Very weak filter
  // If no dedicated baro sensor is available, attempt to get a reading from the MAP sensor. This can only be done if the engine is not running. 
  } else if ((currentStatus.RPM == 0U) && !engineIsRunning(micros()-MICROS_PER_SEC)) {
    setBaroFromMAP();
  } else {
    // Do nothing - baro remains at last read value & MISRA checker is kept happy.
  }
}

/**
 * @brief Initialize MAP and barometric pressure sensors at startup.
 *
 * Performs initial reading of MAP/baro sensors to establish baseline values
 * before engine start. Critical for proper fuel/ignition calculations.
 *
 * **Initialization Sequence:**
 * 1. Zeros out MAP algorithm state (cycle/event averages)
 * 2. Reads initial baro pressure:
 *    - **External Baro Sensor:** Direct unfiltered read from dedicated pin
 *    - **MAP-Based Baro:** Loads last known good value from EEPROM
 *    - Validates baro range (65-108 kPa)
 *    - Falls back to 100 kPa if EEPROM invalid (first run)
 * 3. Takes MAP reading (engine must be stopped)
 *
 * **EEPROM Baro Recovery:**
 * - Last known baro saved to EEPROM on engine stop
 * - Prevents invalid startup values at high altitude
 * - Validated against physical limits (65-108 kPa)
 *
 * @note Must be called with engine stopped (MAP = atmospheric pressure)
 * @note Caller responsible for ensuring engine is not running
 * @note Updates `currentStatus.baro`, `mapAlgorithmState`
 * @see readBaro() for runtime baro updates
 * @see setBaroFromMAP() for MAP-based baro reading
 */
void initialiseMAPBaro(void) 
{
  //Initialise MAP values to all 0's
  (void)memset(&mapAlgorithmState, 0, sizeof(mapAlgorithmState));
  
  //Initialise baro
  if ( configPage6.useExtBaro != 0U  )
  {
    // Use raw unfiltered value initially
    setBaroFromSensorReading(readMAPSensor(pinBaro));
  }
  else
  {
    //Attempt to use the last known good baro reading from EEPROM as a starting point
    uint8_t lastBaro = readLastBaro();
    // Make sure it's not invalid (Possible on first run etc)
    currentStatus.baro = isValidBaro(lastBaro) ? lastBaro : 100U;
    // We assume external callers already made sure the engine isn't running
    setBaroFromMAP();
  }
}

/**
 * @brief Reset MAP sampling algorithm state (cycle and event averages).
 *
 * Clears accumulated MAP samples from cycle average, cycle minimum, and
 * event average algorithms. Used when changing MAP sampling mode or when
 * engine synchronization is lost.
 *
 * **When to Call:**
 * - User changes MAP sampling algorithm in TunerStudio
 * - Engine sync lost (crank/cam sensor error)
 * - Transition from cranking to running
 * - MAP sensor fault detected
 *
 * **State Cleared:**
 * - `mapAlgorithmState.cycle_average` - Running totals and sample counts
 * - `mapAlgorithmState.cycle_min` - Minimum value tracking
 * - `mapAlgorithmState.event_average` - Event-based accumulation
 *
 * @note Does NOT reset `mapAlgorithmState.sensorReadings` (last ADC values)
 * @note Does NOT reset `mapAlgorithmState.lastReading` (for accel enrich)
 * @note Safe to call at any time (no critical section needed)
 */
void resetMAPcycleAndEvent(void)
{
  (void)memset(&mapAlgorithmState.cycle_average, 0, sizeof(mapAlgorithmState.cycle_average));
  (void)memset(&mapAlgorithmState.cycle_min, 0, sizeof(mapAlgorithmState.cycle_min));
  (void)memset(&mapAlgorithmState.event_average, 0, sizeof(mapAlgorithmState.event_average));
}

// ========================================== O2 ==========================================

/**
 * @brief Read primary oxygen (O2) sensor with calibration table.
 *
 * Reads raw ADC value from O2 sensor pin, applies low-pass filter, and converts
 * to lambda/AFR using 32-point calibration table. Only operates if sensor type
 * is configured (prevents dangerous readings from uncalibrated sensors).
 *
 * **Sensor Types Supported:**
 * - Narrowband (0-1V, 0.1-0.9V usable)
 * - Wideband (0-5V linear with lambda)
 * - Bosch LSU 4.2, 4.9, ADV (via controller)
 *
 * **Calibration Table:**
 * - X-axis: Raw ADC values (0-1023)
 * - Y-axis: Lambda × 100 or AFR × 10 (depending on display mode)
 * - 32 calibration points for accurate sensor curve
 *
 * @note Updates `currentStatus.O2`, `currentStatus.O2ADC`
 * @note Filter constant: `configPage4.ADCFILTER_O2`
 * @note Sets both to 0 if `configPage6.egoType == 0` (sensor disabled)
 */
void readO2(void)
{
  //An O2 read is only performed if an O2 sensor type is selected. This is to prevent potentially dangerous use of the O2 readings prior to proper setup/calibration
  if(configPage6.egoType > 0U)
  {
    currentStatus.O2ADC = LOW_PASS_FILTER(readAnalogSensor(pinO2), configPage4.ADCFILTER_O2, currentStatus.O2ADC);
    currentStatus.O2 = table2D_getValue(&o2CalibrationTable, currentStatus.O2ADC);
  }
  else
  {
    currentStatus.O2ADC = 0U;
    currentStatus.O2 = 0U;
  }

