Guiimartinho/speeduino-stm32f407-refactor/speeduino/sensors.cpp
}

/**
 * @brief Read secondary oxygen (O2_2) sensor with calibration table.
 *
 * Reads raw ADC value from second O2 sensor pin, applies low-pass filter,
 * and converts using same calibration table as primary O2 sensor.
 *
 * **Use Cases:**
 * - Dual-bank V-engines (one sensor per bank)
 * - Pre/post-catalyst monitoring
 * - Backup sensor for redundancy
 *
 * @note Updates `currentStatus.O2_2`, `currentStatus.O2_2ADC`
 * @note Filter constant: `configPage4.ADCFILTER_O2`
 * @note Uses same calibration table as primary O2 sensor
 * @note Currently always enabled when called (no disable check like O2)
 */
void readO2_2(void)
{
  //Second O2 currently disabled as its not being used
  //Get the current O2 value.
  currentStatus.O2_2ADC = LOW_PASS_FILTER(readAnalogSensor(pinO2_2), configPage4.ADCFILTER_O2, currentStatus.O2_2ADC);
  currentStatus.O2_2 = table2D_getValue(&o2CalibrationTable, currentStatus.O2_2ADC);
}

// ============================================================================
// REFACTORED: readBat() - USB Transition Extraction Pattern (FASE C7)
// Complexity reduced: High -> Low
// Nesting reduced: 3 levels -> 2 levels
// Pattern: Extract complex conditional logic to dedicated helper
// ============================================================================

namespace {

/**
 * @brief Detect and handle USB-to-battery power transition.
 *
 * When the ECU is powered from USB for tuning and then switched to 12V battery,
 * certain subsystems need re-initialization to prevent stale state.
 *
 * **Detection Criteria:**
 * - Previous voltage < 5.5V (USB power range)
 * - New voltage > 7.0V (12V battery range)
 * - Engine not running (RPM = 0)
 *
 * **Actions on Transition:**
 * 1. Re-prime fuel pump (clear prime flag)
 * 2. Re-home stepper motor IAC (if using step-CL or step-OL algorithm)
 *
 * @param newBatteryReading New battery voltage reading (×10 format, e.g., 125 = 12.5V)
 * @note Only triggers when voltage jumps USB→12V with engine stopped
 * @note Prevents using stale sensor values from USB-powered initialization
 */
static inline void handleUSBToBatteryTransition(int16_t newBatteryReading)
{
  // Check if USB→12V transition occurred (voltage jumped from <5.5V to >7.0V with engine off)
  if( (currentStatus.battery10 < 55U) && (newBatteryReading > 70) && (currentStatus.RPM == 0U) )
  {
    // Re-prime the fuel pump (clear primed flag and restart timer)
    fpPrimeTime = currentStatus.secl;
    currentStatus.fpPrimed = false;
    FUEL_PUMP_ON();

    // Re-home stepper motor IAC if configured
    if( (configPage6.iacAlgorithm == IAC_ALGORITHM_STEP_CL) || (configPage6.iacAlgorithm == IAC_ALGORITHM_STEP_OL) )
    {
      initialiseIdle(true);
    }
  }
}

} // anonymous namespace (readBat helpers)

/**
 * @brief Read battery voltage with offset calibration and USB detection.
 *
 * Reads raw ADC value from battery sense pin, applies calibration offset,
 * and detects power source transitions (USB → 12V battery).
 *
 * **Voltage Range:**
 * - ADC input: 0-1023 (10-bit)
 * - Output range: 0.0V to 24.5V (stored as × 10, e.g., 125 = 12.5V)
 * - Calibration: ±12.7V offset (`configPage4.batVoltCorrect`)
 *
 * **USB → Battery Transition Detection:**
 * - If voltage jumps from <5.5V to >7.0V with engine stopped:
 *   - Re-primes fuel pump
 *   - Re-homes stepper motor IAC (if configured)
 *   - Prevents stale initial conditions
 *
 * @note Updates `currentStatus.battery10` (voltage × 10)
 * @note Filter constant: `configPage4.ADCFILTER_BAT`
 * @note Triggers fuel pump prime + IAC homing on USB→12V transition
 */
void readBat(void)
{
  int16_t tempReading = fastMap10Bit(readAnalogSensor(pinBat), 0, 245); //Get the current raw Battery value. Permissible values are from 0v to 24.5v (245)

  //Apply the offset calibration value to the reading
  tempReading += configPage4.batVoltCorrect;
  if(tempReading < 0){
    tempReading=0;
  }  //with negative overflow prevention

  // Detect USB→12V transition and re-initialize subsystems if needed
  handleUSBToBatteryTransition(tempReading);

  currentStatus.battery10 = LOW_PASS_FILTER(tempReading, configPage4.ADCFILTER_BAT, currentStatus.battery10);
}

/**
 * @brief Get time gap between VSS pulses from circular buffer history.
 *
 * Reads pulse timing data from interrupt-driven circular buffer to calculate
 * time between consecutive VSS pulses. Used for speed calculation in interrupt mode.
 *
 * **Circular Buffer:**
 * - Size: `VSS_SAMPLES` entries (typically 4)
 * - Updated by `vssPulse()` ISR on each pulse
 * - `vssIndex` points to most recent entry
 *
 * **History Indexing:**
 * - `historyIndex = 0`: Latest pulse gap (most recent)
 * - `historyIndex = 1`: Second most recent gap
 * - `historyIndex = N`: (N+1)th most recent gap
 *
 * @param historyIndex Index into history buffer (0 = latest, 1 = previous, etc.)
 * @return Time gap in microseconds between pulses at [historyIndex] and [historyIndex-1]
 * @note Uses `noInterrupts()`/`interrupts()` for thread safety with VSS ISR
 * @note Wraps around circular buffer automatically
 * @complexity C:3, N:2 (down from N:3 via ternary operator)
 */
uint32_t vssGetPulseGap(uint8_t historyIndex)
{
  uint32_t tempGap;

  noInterrupts();
  int8_t tempIndex = vssIndex - historyIndex;
  if(tempIndex < 0) { tempIndex += (int8_t)VSS_SAMPLES; }

  // Calculate gap with wrap-around: normal case vs. circular buffer wraparound
  tempGap = (tempIndex > 0)
    ? (vssTimes[tempIndex] - vssTimes[tempIndex - 1])
    : (vssTimes[0] - vssTimes[VSS_SAMPLES - 1U]);
  interrupts();

  return tempGap;
}

// ============================================================================
// REFACTORED: getSpeed() - Mode Extraction Pattern (FASE C3)
// Complexity reduced: 10 -> 4
// Lines reduced: 43 -> 21 (51% reduction)
// Nesting reduced: 3 levels -> 2 levels
// Pattern: Extract mode-specific logic into dedicated helpers
// ============================================================================

namespace {

/**
 * @brief Calculate VSS from CAN/Serial auxiliary input channel.
 * @param config VSS configuration from configPage2
 * @param currentVss Current VSS value for filtering
 * @return Filtered speed in km/h
 */
static inline uint16_t getSpeedFromCANSerial(const config2 &config, uint16_t currentVss)
{
  uint16_t rawSpeed = (config.vssPulsesPerKm == 0U)
    ? currentStatus.canin[config.vssAuxCh]
    : (currentStatus.canin[config.vssAuxCh] / config.vssPulsesPerKm);

  return LOW_PASS_FILTER(rawSpeed, config.vssSmoothing, currentVss);
}

/**
 * @brief Calculate VSS from interrupt-driven pulse timing.
 * @param config VSS configuration from configPage2
 * @param currentVss Current VSS value for filtering and fallback
 * @return Filtered speed in km/h (or 0 if stopped)
 */
static inline uint16_t getSpeedFromInterruptDriven(const config2 &config, uint16_t currentVss)
{
  // Check if car has stopped (no pulse in last second)
  if ((micros() - vssTimes[vssIndex]) > MICROS_PER_SEC) {
    return 0U;
  }

