Guiimartinho/speeduino-stm32f407-refactor/speeduino/sensors.cpp
  // Calculate average pulse time from circular buffer
  uint32_t vssTotalTime = 0U;
  for (uint8_t x = 0U; x < (VSS_SAMPLES - 1U); x++) {
    vssTotalTime += vssGetPulseGap(x);
  }
  uint32_t avgPulseTime = vssTotalTime / ((uint32_t)VSS_SAMPLES - 1UL);

  // Convert pulse time to km/h
  uint16_t calculatedSpeed = MICROS_PER_HOUR / (avgPulseTime * config.vssPulsesPerKm);

  // Safety check: reject impossible speeds (hardware issue indicator)
  if (calculatedSpeed > 1000U) {
    return currentVss; // Fallback to last known good value
  }

  return LOW_PASS_FILTER(calculatedSpeed, config.vssSmoothing, currentVss);
}

} // anonymous namespace (getSpeed helpers)

/**
 * @brief Read vehicle speed sensor (VSS) using configured mode.
 *
 * Supports three operating modes:
 * - Mode 0: Disabled
 * - Mode 1: CAN/Serial via auxiliary input channel
 * - Mode >1: Interrupt-driven pulse counting
 *
 * @return Current vehicle speed in km/h (0 if disabled or stopped)
 * @note Uses circular buffer for interrupt mode (VSS_SAMPLES entries)
 * @note Applies configurable low-pass filter for smoothing
 * @complexity C:4, N:2 (down from C:10, N:3)
 */
uint16_t getSpeed(void)
{
  uint16_t tempSpeed = 0U;

  if (configPage2.vssMode == 1U) {
    tempSpeed = getSpeedFromCANSerial(configPage2, currentStatus.vss);
  }
  else if (configPage2.vssMode > 1U) {
    tempSpeed = getSpeedFromInterruptDriven(configPage2, currentStatus.vss);
  }
  else {
    // Mode 0: VSS disabled, return 0
  }

  return tempSpeed;
}

// ============================================================================
// REFACTORED: getGear() - Table-Driven Pattern (FASE C3)
// Complexity reduced: 10 -> 3
// Lines reduced: 23 -> 20 (13% reduction)
// Pattern: Replace if-else chain with loop over gear ratio table
// Benefit: Easy to extend for 7+ gears without increasing complexity
// ============================================================================

namespace {

/**
 * @brief Check if value is within range ± hysteresis.
 * @param value Value to check
 * @param target Target value (center of range)
 * @param hysteresis Tolerance (±)
 * @return true if value is in range [target-hysteresis, target+hysteresis]
 */
static inline bool isWithinHysteresis(uint16_t value, uint16_t target, uint16_t hysteresis)
{
  return (value > (target - hysteresis)) && (value < (target + hysteresis));
}

} // anonymous namespace (getGear helpers)

/**
 * @brief Calculate current transmission gear based on VSS/RPM ratio.
 *
 * Uses configurable gear ratios (pulses per 1000 RPM) with hysteresis
 * to prevent gear hunting. Supports up to 6 forward gears.
 *
 * @return Detected gear (1-6), or 0 if unknown/stopped
 * @note Returns last known gear if current ratio doesn't match any defined gear
 * @note Requires non-zero VSS to operate
 * @complexity C:3, N:2 (down from C:10, N:2)
 */
byte getGear(void)
{
  if (currentStatus.vss == 0U) {
    return 0U; // Vehicle stopped, gear unknown
  }

  // Calculate pulses per 1000 RPM (×10 for TunerStudio ratio format)
  uint16_t pulsesPer1000rpm = udiv_32_16(currentStatus.vss * 10000UL, currentStatus.RPM);

  // Gear ratio lookup table (maps to configPage2 vssRatio1-6)
  const uint16_t gearRatios[6] = {
    configPage2.vssRatio1, configPage2.vssRatio2, configPage2.vssRatio3,
    configPage2.vssRatio4, configPage2.vssRatio5, configPage2.vssRatio6
  };

  // Check each gear ratio with hysteresis
  for (uint8_t gear = 0U; gear < 6U; gear++) {
    if (isWithinHysteresis(pulsesPer1000rpm, gearRatios[gear], VSS_GEAR_HYSTERESIS_VALUE)) {
      return gear + 1U; // Gears are 1-indexed (1st, 2nd, etc.)
    }
  }

  // No match found: retain last detected gear to prevent hunting
  return currentStatus.gear;
}

/**
 * @brief Read analog fuel pressure sensor with calibration and filtering.
 *
 * Reads raw ADC value from fuel pressure sensor pin, applies linear calibration,
 * low-pass filter, and range clamping. Only operates if sensor is enabled in config.
 *
 * **Calibration:**
 * - `configPage10.fuelPressureMin`: Pressure at 0V (e.g., 0 psi)
 * - `configPage10.fuelPressureMax`: Pressure at 5V (e.g., 100 psi)
 * - Linear interpolation between min/max
 *
 * **Use Cases:**
 * - Returnless fuel systems (pressure monitoring)
 * - High-pressure direct injection
 * - Fuel pump health monitoring
 * - Diagnostics and datalogging
 *
 * @return Fuel pressure in PSI (0-255), or 0 if sensor disabled
 * @note Updates `currentStatus.fuelPressure`
 * @note Filter constant: `ADCFILTER_PSI_DEFAULT`
 * @note Enabled by `configPage10.fuelPressureEnable`
 */
byte getFuelPressure(void)
{
  int16_t tempFuelPressure = 0;

  if(configPage10.fuelPressureEnable > 0U)
  {
    tempFuelPressure = fastMap10Bit(readAnalogSensor(pinFuelPressure), configPage10.fuelPressureMin, configPage10.fuelPressureMax);
    tempFuelPressure = LOW_PASS_FILTER(tempFuelPressure, ADCFILTER_PSI_DEFAULT, currentStatus.fuelPressure); //Apply smoothing factor
    //Sanity checks
    tempFuelPressure = clamp(tempFuelPressure, (int16_t)0, (int16_t)configPage10.fuelPressureMax);
  }

  return (byte)tempFuelPressure;
}

/**
 * @brief Read analog oil pressure sensor with calibration and filtering.
 *
 * Reads raw ADC value from oil pressure sensor pin, applies linear calibration,
 * low-pass filter, and range clamping. Only operates if sensor is enabled in config.
 *
 * **Calibration:**
 * - `configPage10.oilPressureMin`: Pressure at 0V (e.g., 0 psi)
 * - `configPage10.oilPressureMax`: Pressure at 5V (e.g., 100 psi)
 * - Linear interpolation between min/max
 *
 * **Use Cases:**
 * - Engine protection (low oil pressure cutoff)
 * - Oil system health monitoring
 * - Variable valve timing diagnostics
 * - Datalogging and warning lights
 *
 * @return Oil pressure in PSI (0-255), or 0 if sensor disabled
 * @note Updates `currentStatus.oilPressure`
 * @note Filter constant: `ADCFILTER_PSI_DEFAULT`
 * @note Enabled by `configPage10.oilPressureEnable`
 */
byte getOilPressure(void)
{
  int16_t tempOilPressure = 0;

  if(configPage10.oilPressureEnable > 0U)
  {
    //Perform ADC read
    tempOilPressure = fastMap10Bit(readAnalogSensor(pinOilPressure), configPage10.oilPressureMin, configPage10.oilPressureMax);
    tempOilPressure = LOW_PASS_FILTER(tempOilPressure, ADCFILTER_PSI_DEFAULT, currentStatus.oilPressure); //Apply smoothing factor
    //Sanity check
    tempOilPressure = clamp(tempOilPressure, (int16_t)0, (int16_t)configPage10.oilPressureMax);
  }


  return (byte)tempOilPressure;
}

/**
 * @brief Read analog knock sensor voltage level.
 *
 * Reads raw ADC value from analog knock sensor pin and maps to 0-255 range.
 * Used for analog knock controllers/conditioners that output variable voltage
 * proportional to knock intensity.
 *
 * **Pin Selection:**
 * - User configures analog pin number in TunerStudio
 * - `configPage10.knock_pin >= 47`: Analog pins (A0 = position 47)
 * - Pin is translated via `pinTranslateAnalog()` to physical pin number
 * - Default: A15 if invalid pin selected
 *
 * **Knock Detection Modes:**
 * - **Analog Mode (this function):** Variable voltage (0-5V → 0-255)
 * - **Digital Mode (`knockPulse()` ISR):** Pulse counting per event
 *
 * @return Knock sensor voltage mapped to 0-255 (0 = 0V, 255 = 5V)
 * @note No filtering applied (raw instantaneous reading)
 * @note Used in combination with `correctionKnockTiming()` for ignition retard
 * @see knockPulse() for digital knock sensor interrupt handler
 */
uint8_t getAnalogKnock(void)
{
  uint8_t pinKnock = A15; //Default value in case the user has not selected an analog pin in TunerStudio
  if(configPage10.knock_pin >=47U)
  {
    pinKnock = pinTranslateAnalog(configPage10.knock_pin - 47U); //The knock_pin variable has both digital and analog pins listed. A0 is at position 47
  }

  //Perform ADC read
  return (uint8_t)fastMap10Bit(readAnalogSensor(pinKnock), 0U, 255U);
}

/**
 * @brief ISR: Flex fuel sensor pulse handler (ethanol content measurement).
 *
 * Interrupt service routine that measures flex fuel sensor signal to determine
 * ethanol content in fuel. Standard flex sensors output 50-150 Hz frequency
 * with 1-5 ms pulse width corresponding to 0-100% ethanol.
 *
 * **Measurement Method:**
 * - **Frequency (Hz):** Counted per second via `flexCounter` (reset in main loop)
 * - **Pulse Width (ms):** Rising edge to falling edge duration
 * - Both measurements used to calculate ethanol percentage
 *
 * **Signal Interpretation:**
 * - **E0 (gasoline):** ~50 Hz, ~1 ms pulse width
 * - **E50 (50% ethanol):** ~100 Hz, ~3 ms pulse width
 * - **E85 (85% ethanol):** ~150 Hz, ~5 ms pulse width
 *
 * **Low-Pass Filtering:**
 * - Pulse width filtered via `configPage4.FILTER_FLEX`
 * - Reduces noise from sensor/wiring
 *
 * @note Interrupt triggered on both rising and falling edges
 * @note `flexCounter` incremented on falling edge only
 * @note `flexStartTime` captured on rising edge for pulse width calc
 * @note Main loop resets `flexCounter` every second
 * @warning Must complete in <10 µs to avoid blocking other ISRs
 */
void flexPulse(void)
{
  if(READ_FLEX() == true)
  {
    uint16_t tempPW = clamp(micros() - flexStartTime, 0UL, (unsigned long)UINT16_MAX); //Calculate the pulse width
    flexPulseWidth = LOW_PASS_FILTER(tempPW, configPage4.FILTER_FLEX, flexPulseWidth);
    ++flexCounter;
  }
  else
  {
    flexStartTime = micros(); //Start pulse width measurement.
  }
}

/**
 * @brief ISR: Knock sensor pulse counter (digital knock detection).
 *
 * Interrupt service routine for digital knock sensor/controller. Counts pulses
 * from knock conditioner IC (e.g., IC-DIS-01) that outputs digital pulse train
 * proportional to knock intensity.
 *
 * **Knock Detection Logic:**
 * - Only counts pulses within knock window (configured MAP/RPM range)
 * - RPM limit: `configPage10.knock_maxRPM` (typically 6000-7000 RPM)
 * - MAP limit: `configPage10.knock_maxMAP` × 2 (stored as kPa/2)
 * - Prevents false positives at idle or high load
 *
 * **Pulse Counting:**
 * - Each pulse increments `currentStatus.knockCount`
 * - If knock already active, additional pulses counted in `correctionKnockTiming()`
 * - Sets `BIT_STATUS5_KNOCK_PULSE` flag for main loop processing
 *
 * **Use Cases:**
 * - Digital knock controllers (Bosch/MSD/AEM)
 * - Frequency-output knock sensors
 * - Pulse train from conditioner ICs
 *
 * @note Triggered on rising edge of knock pulse
 * @note Filtered by RPM and MAP to prevent false knock detection
 * @note Knock count processed by `correctionKnockTiming()` for ignition retard
 * @see getAnalogKnock() for analog knock sensor voltage reading
 * @warning Must complete in <5 µs (critical path)
 */
void knockPulse(void)
{
  if( (currentStatus.MAP < (configPage10.knock_maxMAP*2)) && (currentStatus.RPMdiv100 < configPage10.knock_maxRPM) )
  {
    if(!BIT_CHECK(currentStatus.status5, BIT_STATUS5_KNOCK_ACTIVE)) { currentStatus.knockCount++; } //If knock is not currently active we count every pulse. If knock is already active then additional pulses will be counted in correctionKnockTiming()
    BIT_SET(currentStatus.status5, BIT_STATUS5_KNOCK_PULSE);
  }
}

/**
 * @brief ISR: Vehicle Speed Sensor (VSS) pulse handler for interrupt mode.
 *
 * Interrupt service routine that captures timestamps of VSS pulses for speed
 * calculation. Uses circular buffer to store pulse timing history.
 *
 * **Circular Buffer:**
 * - Size: `VSS_SAMPLES` entries (typically 4)
 * - Stores `micros()` timestamp of each pulse
 * - `vssIndex` wraps around at buffer end
 * - Read by `getSpeed()` to calculate average pulse gap
 *
 * **Speed Calculation:**
 * - Pulse gap = time between consecutive pulses
 * - Speed = 3,600,000,000 µs/hr ÷ (pulse gap × pulses/km)
 * - Filtering: Average of last `VSS_SAMPLES-1` gaps
 *
 * **Pulse Sources:**
 * - Hall effect wheel speed sensors
 * - Optical encoders
 * - Speedometer cable pulse generators
 * - ECU speed output (pulse-per-distance)
 *
 * @note Triggered on rising edge of VSS pulse
 * @note Buffer automatically wraps (no overflow risk)
 * @note Thread-safe: `getSpeed()` uses `noInterrupts()` when reading
 * @note TODO: Add basic filtering here (debounce)
 * @see getSpeed() for speed calculation from pulse gaps
 * @see vssGetPulseGap() for reading pulse timing history
 * @warning Must complete in <10 µs to avoid missing pulses at high speed
 */
void vssPulse(void)
{
  //TODO: Add basic filtering here
  vssIndex++;
  if(vssIndex == VSS_SAMPLES) { vssIndex = 0U; }

  vssTimes[vssIndex] = micros();
}

/**
 * @brief Read auxiliary analog input channel (local pin mode).
 *
 * Reads raw ADC value from specified analog pin. Used for auxiliary inputs
 * configured as "Analog Local" in TunerStudio (vs CAN/Serial external sources).
 *
 * **Auxiliary Input System:**
 * - 16 channels total (`currentStatus.canin[0..15]`)
 * - Three input modes per channel:
 *   1. **External CAN/Serial:** Data from external device
 *   2. **Analog Local:** Direct ADC read (this function)
 *   3. **Digital Local:** GPIO read (`readAuxdigital()`)
 *
 * **Use Cases:**
 * - Custom analog sensors (pressure, temp, position)
 * - Auxiliary voltage monitoring
 * - User-defined inputs for tables/corrections
 * - Expansion beyond built-in sensor suite
 *
 * @param analogPin Arduino analog pin number (e.g., A0, A1, etc.)
 * @return Raw ADC value (0-1023 for 10-bit ADC)
 * @note No filtering applied (use external filtering if needed)
 * @note Pin configuration done by `initialiseADC()` during startup
 * @see readAuxdigital() for digital auxiliary inputs
 */
uint16_t readAuxanalog(uint8_t analogPin)
{
  return readAnalogSensor(analogPin); // readAnalogSensor is inlined within this CPP file.
}

/**
 * @brief Read auxiliary digital input channel (local pin mode).
 *
 * Reads digital state (HIGH/LOW) from specified GPIO pin. Used for auxiliary inputs
 * configured as "Digital Local" in TunerStudio (vs CAN/Serial external sources).
 *
 * **Auxiliary Input System:**
 * - 16 channels total (`currentStatus.canin[0..15]`)
 * - Three input modes per channel:
 *   1. **External CAN/Serial:** Data from external device
 *   2. **Analog Local:** ADC read (`readAuxanalog()`)
 *   3. **Digital Local:** GPIO read (this function)
 *
 * **Use Cases:**
 * - Binary sensors (switches, clutch, brake)
 * - Wheel speed sensors (frequency-to-voltage converter)
 * - Launch control switches
 * - User-defined digital flags
 *
 * @param digitalPin Arduino digital pin number
 * @return Digital state: 0 (LOW/ground) or 1 (HIGH/5V)
 * @note No debouncing applied (use external RC filter if needed)
 * @note Pin configuration done by `initialiseADC()` during startup
 * @see readAuxanalog() for analog auxiliary inputs
 */
uint16_t readAuxdigital(uint8_t digitalPin)
{
  //read the Aux digital value for pin set by digitalPin 
  unsigned int tempReading;
  tempReading = digitalRead(digitalPin); 
  return tempReading;
} 
